# __Handling Missing Data__

In [ ]:
import pandas as pd
import numpy as  np

In [ ]:
df=pd.read_csv('D:\\MyEnvironment\\Jupyter-Notebook\\Notebooks\\Dataset\\Data.csv')
df

---
## DropNA
    dropna(): Drops Rows that contains NaN Values
    dropna(axis=1) : Drops Columns that contains NaN Values

In [ ]:
df.dropna()

In [ ]:
df.dropna(axis=1)

##### __how= Parameter using to check if row contains NaN__
    "any" : checks if row contains ANY NaN
    "all" : checks if row is full of NaN

In [ ]:
df.dropna(how="any")

In [ ]:
df.dropna(how="all")

##### __subset=["ColName"] : removes NaN from Particular columns__

In [ ]:
df.dropna(subset=['Age'])

##### __inplace=True : save changes into Original DataFrame__

In [ ]:
df.dropna(inplace=True)
df

In [ ]:
df

##### __thresh= n : removes rows containing n number or NaN__

In [ ]:
df.dropna(thresh=1)

In [ ]:
df.info()

----
## FillNa

In [ ]:
df

### fillna(data) : to fill NaN values with given data.
    fillna({ 'ColName': Data }) : to fill data in particular column

In [ ]:
df.fillna('python')

In [ ]:
df.fillna({"Age":0,"Experience":0})

### Method Parameter: Used to fill data of last row or next row
    method="ffill" : For Forward Filling (fill data same as previous row)
    method="bfill" : For Backward Filling (fill data same as next row)

#### __obj.ffill() & obj.bfill__ can also be used instead.

In [ ]:
# df.fillna(method="ffill")
df.ffill()

In [ ]:
# df.fillna(method="bfill")
df.bfill()

In [ ]:
df

### __axis=1 : for filling data of Columns__

In [ ]:
# f-fill
# df.fillna(method='ffill',axis=1)
# df.ffill(axis=1)

#b-fill
# df.fillna(method='bfill',axis=1)
# df.bfill(axis=1)

### Limit Parameter
    limit = n : fill data into column upto n limit

In [ ]:
df.fillna('python',limit=1)

----
## Replace

In [ ]:
df=pd.read_csv('D:\\MyEnvironment\\Jupyter-Notebook\\Notebooks\\Dataset\\Data.csv')
df

### Replace function  : to replace any/all value within data set
    df.replace(to_replace='Ali', value='Raza')
    to_replace= : data to be replaced
    value= : replacement value

In [ ]:
# df.replace(to_replace='Ali',value='Raza')
df.replace(to_replace=[1,2,3,4,5,6,7],value=20)

### Regex Parameter

In [ ]:
df.replace('[A-Za-z]','python',regex=True)

### Replace Data of Partcular Column Using Dictionary

In [ ]:
df.replace({"Name":'[A-Z]'},25,regex=True)

### Replace Data using Forward Filling and Backward Filling

### __Forward Filling__

In [ ]:
df.replace(1,method='ffill')

### __Backward Filling__

In [ ]:
df.replace(1,method='bfill')

### Limit Parameter
    limit = n : fill data into column upto n limit

In [ ]:
df.replace('IT',method="bfill",limit=1)

### Inplace Parameter 
     Save changes into original dataset

In [ ]:
df.replace('IT',method="bfill",limit=1,inplace=True)

----
## Interpolate

In [46]:
df

    EmpID    Name       Dept   Age   Salary  Experience
0   101.0     Ali         IT  22.0  45000.0         1.0
1   102.0    Sara         HR  29.0  52000.0         5.0
2   103.0   Ahmed         IT  24.0  48000.0         2.0
3   104.0    Zara    Finance  31.0  60000.0         7.0
4   105.0   Usman         HR  26.0  50000.0         3.0
5   106.0    Hina         IT  23.0  47000.0         1.0
6   107.0   Bilal         HR  28.0  55000.0         4.0
7   108.0    Nida         it  30.0  62000.0         6.0
8   109.0     NaN    Finance   NaN  58000.0         8.0
9   110.0    Omer  Marketing  25.0      NaN         2.0
10  101.0     Ali         IT  22.0  45000.0         1.0
11  112.0   Tariq      Sales  45.0  70000.0        15.0
12  113.0  Haroon         IT  21.0  55000.0         NaN
13    NaN     NaN        NaN   NaN      NaN         NaN
14  114.0  Shahid         HR  22.0  55000.0         1.0

In [52]:
df.interpolate()

C:\Users\Professor\AppData\Local\Temp\ipykernel_18524\4002874584.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate()

    EmpID    Name       Dept   Age   Salary  Experience
0   101.0     Ali         IT  22.0  45000.0    1.000000
1   102.0    Sara         HR  29.0  52000.0    5.000000
2   103.0   Ahmed         IT  24.0  48000.0    2.000000
3   104.0    Zara    Finance  31.0  60000.0    7.000000
4   105.0   Usman         HR  26.0  50000.0    3.000000
5   106.0    Hina         IT  23.0  47000.0    1.000000
6   107.0   Bilal         HR  28.0  55000.0    4.000000
7   108.0    Nida         it  30.0  62000.0    6.000000
8   109.0     NaN    Finance  27.5  58000.0    8.000000
9   110.0    Omer  Marketing  25.0  51500.0    2.000000
10  101.0     Ali         IT  22.0  45000.0    1.000000
11  112.0   Tariq      Sales  45.0  70000.0   15.000000
12  113.0  Haroon         IT  21.0  55000.0   10.333333
13  113.5     NaN        NaN  21.5  55000.0    5.666667
14  114.0  Shahid         HR  22.0  55000.0    1.000000